---
kind: property
id: P:Autodesk.Revit.DB.PDFExportOptions.ReplaceHalftoneWithThinLines
source: html/c45f8d1f-d494-2218-24c4-8ffdb81ec72b.htm
---
# Autodesk.Revit.DB.PDFExportOptions.ReplaceHalftoneWithThinLines Property

Whether to replace halftone with thin lines.

## Syntax (C#)
```csharp
public bool ReplaceHalftoneWithThinLines { get; set; }
```